let  x1, y1, x2, y2, x3, y3, x4, y4


x1 =  prompt("первая координата 1 вершины?")
y1 =  prompt("вторая координата 1 вершины?")
x2 =  prompt("первая координата 2 вершины?")
y2 =  prompt("вторая координата 2 вершины?")
x3 =  prompt("первая координата 3 вершины?")
y3 =  prompt("вторая координата 3 вершины?")




if (x1 == x2) 
    { 
    x4 = x3
    }
else {
    if  (x1 == x3)
    { 
    x4 = x2
    }
    else {
            x4 = x1
        }
    }         
if (y1 == y2) 
    { 
    y4 = y3
    }
else {
    if  (y1 == y3)
    { 
    y4 = y2
    }
    else {
            y4 = y1
        }
    }         
alert ("четверта вершина знаходиться за координатами ("+x4+","+y4+")")